import React from "react";
import "./BlogDetails.scss";
import BlogDescription from "../../BlogDescription/BlogDescription";
import CardWithButton from "../../cards/CardWithButton/CardWithButton";
const BlogDetails = () => {
  return (
    <div className="container" dir="rtl">
      <BlogDescription />
      <p className="col-12 blog-content mt-5 mb-3 line-height">
        قامت شركة تويتر بإلغاء إحدى ميزاتها الأصيلة الأسبوع الماضي وذلك بإيقاف
        ميزة استقبال نص التغريدات الجديدة على شكل رسالة نصية SMS ! الميزة لا تعد
        أمراً مهماً للغالبية العظمى من مستخدميي المنصة الإجتماعية الذين هم
        بالأساس متصلين بحساباتهم على الدوام عن طريق التطبيق أو من نسخة الويب
        وبذلك فهم على إطلاع مستمر ومباشر على التايم لاين خاصتهم وتغريدات
        المتابعين بالإضافة إلى أن للميزات التي توفرها المنصة من تفضيلات وقوائم
        وموضوعات وتخصيص الإشعارات تجعل الأمر أكثر سلاسة من انتظار رسالة SMS. إلا
        أن هذا لم يدفع بالمنصة الاجتماعية لإيقاف الميزة بشكل كامل عن جميع
        المستخدمين في جميع الدول؛ حيث قالت بأن الميزة تم تعطيلها عن المستخدمين
        في دول العالم إلا بعض منها لا زالت تعتمد على الخاصية للقيام بالأعمال.
        وبالرجوع إلى سبتمبر الماضي 2019 فقد قامت تويتر بإيقاف ميزة التغريد عن
        طريق الرسائل النصية القصيرة SMS بعد عملية اختراق استهدفت حساب مؤسس
        التطبيق جاك دورسي؛ حيث قالت حينها أن التعطيل جاء لحماية المستخدمين من
        استغلال القراصنة لثغرة في نظام التغريد عبر الرسائل. فيما يبدو أن عملية
        ايقاف استقبال التغريدات عبر رسائل SMS تأتي من باب المحافظة على حسابات
        المستخدمين من الاختراق أيضاً حيث قال المتحدث الرسمي للمنصة أن هذه
        الإجراءات تأتي للحفاظ على حساب المستخدمين آمنة. فيما أضاف أن المنصة
        مستمرة بإرسال الرسائل النصية SMS للمستخدمين بما يخص إجراءات التنبيه
        والأمان وإعدادات المصادقة المتعبة للحفاظ على حساباتهم.
      </p>
      <img
        src={require("../../../constant/images/blog-description.svg")}
        style={{ borderRadius: 10, width: "100%" }}
      />
      <p className="col-12 blog-content my-3 line-height">
        إلا أن هذا لم يدفع بالمنصة الاجتماعية لإيقاف الميزة بشكل كامل عن جميع
        المستخدمين في جميع الدول؛ حيث قالت بأن الميزة تم تعطيلها عن المستخدمين
        في دول العالم إلا بعض منها لا زالت تعتمد على الخاصية للقيام بالأعمال.
        وبالرجوع إلى سبتمبر الماضي 2019 فقد قامت تويتر بإيقاف ميزة التغريد عن
        طريق الرسائل النصية القصيرة SMS بعد عملية اختراق استهدفت حساب مؤسس
        التطبيق جاك دورسي؛ حيث قالت حينها أن التعطيل جاء لحماية المستخدمين من
        استغلال القراصنة لثغرة في نظام التغريد عبر الرسائل. فيما يبدو أن عملية
        ايقاف استقبال التغريدات عبر رسائل SMS تأتي من باب المحافظة على حسابات
        المستخدمين من الاختراق أيضاً حيث قال المتحدث الرسمي للمنصة أن هذه
        الإجراءات تأتي للحفاظ على حساب المستخدمين آمنة.
      </p>
      <div className="d-flex justify-content-center justify-content-md-start mt-5">
        <div className="pointer">
        </div>
        <h5 className="text-center text-md-right mr-3 parts">القسم الثاني</h5>
      </div>
      <p className="col-12 text-center text-md-right line-height">
        قامت شركة تويتر بإلغاء إحدى ميزاتها الأصيلة الأسبوع الماضي وذلك بإيقاف ميزة استقبال نص التغريدات الجديدة على شكل رسالة نصية SMS !

        الميزة لا تعد أمراً مهماً للغالبية العظمى من مستخدميي المنصة الإجتماعية الذين هم بالأساس متصلين بحساباتهم على الدوام عن طريق التطبيق أو من نسخة الويب وبذلك فهم على إطلاع مستمر ومباشر على التايم لاين خاصتهم وتغريدات المتابعين بالإضافة إلى أن للميزات التي توفرها المنصة من تفضيلات وقوائم وموضوعات وتخصيص الإشعارات تجعل الأمر أكثر سلاسة من انتظار رسالة SMS.

        إلا أن هذا لم يدفع بالمنصة الاجتماعية لإيقاف الميزة بشكل كامل عن جميع المستخدمين في جميع الدول؛ حيث قالت بأن الميزة تم تعطيلها عن المستخدمين في دول العالم إلا بعض منها لا زالت تعتمد على الخاصية للقيام بالأعمال.
        وبالرجوع إلى سبتمبر الماضي 2019 فقد قامت تويتر بإيقاف ميزة التغريد عن طريق الرسائل النصية القصيرة SMS بعد عملية اختراق استهدفت حساب مؤسس التطبيق جاك دورسي؛ حيث قالت حينها أن التعطيل جاء لحماية المستخدمين من استغلال القراصنة لثغرة في نظام التغريد عبر الرسائل.

        فيما يبدو أن عملية ايقاف استقبال التغريدات عبر رسائل SMS تأتي من باب المحافظة على حسابات المستخدمين من الاختراق أيضاً حيث قال المتحدث الرسمي للمنصة أن هذه الإجراءات تأتي للحفاظ على حساب المستخدمين آمنة.
        فيما أضاف أن المنصة مستمرة بإرسال الرسائل النصية SMS للمستخدمين بما يخص إجراءات التنبيه والأمان وإعدادات المصادقة المتعبة للحفاظ على حساباتهم.
      </p>
      <div>
      <h4 className="text-center text-md-right last-technology-update mt-5">
        مقالات مشابهة
      </h4>
      <div className="container">
        <div className="row">
          <div className="col-12 col-lg-4 col-md-6">
            <CardWithButton
              img={require("../../../constant/images/card-image1.png")}
              cardTitle="ثورة الهواتف القابلة للطي  Z Flip هاتف سامسونج"
              cardDetials="ثورة الهواتف القابلة للطي  Z Flip هاتف سامسونج ثورة الهواتف القابلة للطي  Z Flip هاتف سامسونج ثورة الهواتف القابلة للطي  Z Flip هاتف سامسونج"
            />
          </div>
          <div className="col-12 col-lg-4 col-md-6">
            <CardWithButton
              img={require("../../../constant/images/card-image2.png")}
              cardTitle="ثورة الهواتف القابلة للطي  Z Flip هاتف سامسونج"
              cardDetials="ثورة الهواتف القابلة للطي  Z Flip هاتف سامسونج ثورة الهواتف القابلة للطي  Z Flip هاتف سامسونج ثورة الهواتف القابلة للطي  Z Flip هاتف سامسونج"
            />
          </div>
          <div className="col-12 col-lg-4 col-md-6">
            <CardWithButton
              img={require("../../../constant/images/card-image3.png")}
              cardTitle="ثورة الهواتف القابلة للطي  Z Flip هاتف سامسونج"
              cardDetials="ثورة الهواتف القابلة للطي  Z Flip هاتف سامسونج ثورة الهواتف القابلة للطي  Z Flip هاتف سامسونج ثورة الهواتف القابلة للطي  Z Flip هاتف سامسونج"
            />
          </div>
        </div>
      </div>
      </div>
    </div>
  );
};
export default BlogDetails;
